 {
  "St. Stephen" : {"name":"St. Stephen","death":"Stoned to Death","description":"Stoning is a traditional punishment, but among Christian martyrs, St. Stephen, who died in 36 AD in Jerusalem, was the first to suffer that fate. He was one of the first seven deacons chosen by the early Christian community and became an evangelist. His success in converting Jews drew the ire of the Sanhedrin (the supreme rabbinic court. His punishment for speaking against 'this holy place and the law' was to be stoned to death. As is common to many icons of Catholic martyrdom, St. Stephen is often depicted in paintings as holding the method of his death: a basket of stones.","imgSrc":"./img/stephen.jpg"},

  "St. Sebastian": {"name":"St. Sebastian","death":"Not by Arrows!","description":"One might think from the fact that he is usually portrayed in art as having been shot through with arrows that St. Sebastian died (c. 288 in Rome) at the hands of a battery of archers, but no. That was just the first time he was killed. A Praetorian Guard under Diocletian (a committed persecutor of Christians), Sebastian was sentenced to death after it was found out that he was a Christian who had been converting his fellow soldiers. He was tied to a tree, his sentence of being killed with arrows was carried out, and he was left for dead. He wasn't, however, and was found by a woman (later St. Irene) who nursed him back to health. Sebastian subsequently took the chance of appearing before Diocletian again; the emperor then had him clubbed to death, a punishment that did, in fact, work, and his body was dumped into a Roman sewer.","imgSrc":"./img/sebastian.jpg"},

  "St. Lawrence": {"name":"St. Lawrence","death":"Grilled","description":"Saint Lawrence was a victim of persecution by the Roman emperor Valerian in 258. A deacon under Pope (later St.) Sixtus II, he was disheartened when his patron was led off for his own execution; Sixtus comforted Lawrence by telling him that the same fate would befall him in three days. And he was right. Although Sixtus was beheaded, and Lawrence probably was as well, St. Lawrence's legend states that he was grilled alive—as in, on an actual red-hot gridiron. It was recorded by his hagiographers that he bore his slow torture stoically, even quipping, in the style of a modern-day action-film hero, 'Turn me over; I'm cooked on that side.'","imgSrc":"./img/lawrence.jpg"},

  "St. Cassius": {"name":"St. Cassius","death":"Hacked to Death by Children","description":"Cassian was a teacher in Imola, Italy, in 363. Formerly the bishop of Brescia, he became a schoolmaster after his banishment from that place. As a Christian teacher of pagan pupils during a period of Christian persecution in the Roman Empire, Cassian was in a dangerous position. By refusing to make sacrifice to the pagan gods, he angered the local officials, who sentenced him to death and turned him over to his students as his executioners. Why this should be the case and why they seemed happy to carry out the sentence is not entirely clear from historical accounts. But Cassian's death was torturous because of it: the only instruments the students had at their disposal were small and non-lethal. The boys employed their tablets to bash Cassian and their styluses (pointed iron instruments for writing) and penknives to make a multitude of cuts and punctures all over his body for an agonizingly extended time. Conscious through the long process, Cassian encouraged them to strike him forcefully, as he was eager to die for his faith.","imgSrc":"./img/cassius.jpg"},

  "St. Bartholomew": {"name":"St. Bartholomew","death":"flayed","description":"Bartholomew (probably Nathanael bar Tolmai) is usually identified as one of the Twelve Apostles chosen by Jesus Christ. Little is known of him historically, and his death date is not known, but it is traditionally said that he died in Albanopolis, Armenia. There is evidence that he was a missionary to what are now Iran and Turkey as well as Armenia, Ethiopia, and Mesopotamia, and that the Armenian king Astyages called for his death after Bartholomew converted the king's brother. The manner of that death is a matter of dispute: beheaded? Crucified upside-down? The method, however, with which Bartholomew is usually identified is singularly grotesque: flaying. That is, his skin was fully removed from his body, in strips, while he was still alive... and then he was beheaded for good measure. He is often depicted in art peeled, or half-peeled, with his 'birthday suit' wrapped around him. St. Bartholomew is the patron saint of many causes and occupations, including tanners.","imgSrc":"./img/bartholomew.jpg"}
}
